[
     {
        "id": "008",
        "customer": "carla.land",
        "title":"Portfolio",
        "tags":"Angular, Bootstrap, FontAwesome, GithubPages, Git",
        "tagsArray":[
            "Angular", "Bootstrap", "FontAwesome", "GithubPages", "Git"
        ],
        "description":"",
        "shortDescription":"Portfolio Webseite, die du hier siehst. Erstellt mit Angular.",
        "image": "./assets/carla-bw.jpg"
    },
    {
        "id": "007",
        "customer": "Büro Babette",
        "title":"KoRe Excel",
        "tags":"Excel",
        "tagsArray":["Excel"],
        "description":"Toller Spass!",
        "shortDescription":"",
        "image":"./assets/babette.png"
    },
    {
        "id": "007",
        "customer": "Byffel",
        "title":"Projekt Nebelhorn",
        "tags":"",
        "tagsArray":[
            "Angular","JavaScript","Editor.js","Kanban","Agile","Docker", "Kubernetes"
        ],
        "description":"Privates Projekt, welches noch nicht spruchreif ist. Deshalb noch keine Beschreibung. Dafür ein Bild von einem herzigen Büffel.",
        "shortDescription":""
    },
    {
        "id": "006",
        "customer": "Kundin der bbv Software Services AG",
        "title":"Sidegrade",
        "tags":"Java, Scrum, TDD, Clean Code, Code Review, Jira, Jenkins, Git, Eclipse, IntelliJ, JBoss, Websphere, JUnit, Gerrit",
        "tagsArray":[],
        "description":"",
        "shortDescription":""
    },
    {
        "id": "005",
        "customer": "WELCOME Immobilien AG",
        "title":"Bachelordiplomarbeit: mySTWEG",
        "tags":"SoDa, Ionic Framework, Angular, Typescript, Cordova, C#, MS SQL, VSTS, Azure Cloud, Webstorm, Visual Studio, SQL Server Management Studio, Visual Studio App Center, Git",
        "tagsArray":["SoDa","Ionic Framework","Angular","Typescript","Cordova","C#","MS SQL","VSTS","Azure Cloud","Webstorm","Visual Studio","SQL Server Management Studio","Visual Studio App Center","Git"],
        "description":"Um die Kommunikation unter Eigentümer und zwischen der Immobilienfirma bei Stockwerkeigentumswohnungen zu vereinfachen, möchte WELCOME Immobilien eine Plattform lancieren. Im Rahmen meiner Bachelordiplomarbeit befasste ich mich in einem Zweierteam mit der Entwicklung der Architektur, der Wahl der geeigneten Technologien und dem Erstellen eines Prototypen einer Kommunikationsplattform für Stockwerkeigentümer und Immobilienverwaltungen. Das Projekt wurde nach dem Projektmodell SoDa durchgeführt. Während der Initialisierungsphase habe ich die Anforderungen aufgenommen, die Architektur entwickelt und die geeigneten Technologien ausgewählt. Beim Entwickeln der Architektur musste berücksichtigt werden, dass die Lösung zu einem späteren Zeitpunkt als Software-as-a-Service eingesetzt werden soll (Skalierbarkeit). Ausserdem wurde das Architekturprinzip «Design for Change» mit in den Entwurf einbezogen. Anschliessen wurden die einzusetzenden Technologien in den Bereichen Datenbank, Front- und Backend evaluiert und ausgewählt. Während den darauffolgenden Sprints habe ich in der Rolle des Product Owners die User Stories priorisiert und in der Rolle der Entwicklerin umgesetzt. Als Scrummaster habe ich die Sprintreviews geleitet. Als Ergebnisse konnte ich der WELCOME Immobilien AG eine browserbasierte, responsive Webapplikation übergeben, die in allen gängigen Browsern und Betriebssystemen lauffähig ist. Zusätzlich zur Webapplikation wurde mithilfe von Cordova eine native Android App erstellt. Die dazugehörige Dokumentation soll die Weiterentwicklung von mySTWEG ermöglichen. Der entwickelte Prototyp ist bei der gesamten Belegschaft von WELCOME Immobilien AG auf Begeisterung gestossen. Auch andere Immobilienfirmen haben grosses Interesse am Prototypen gezeigt. SoDa: 'Software Development agile' - basiert auf dem Vorgehensmodell Scrum und bindet dieses in einen Projektmanagement-Rahmen ein (Scrum-Adaption der Hochschule Luzern)",
        "shortDescription":"Kommunikationsplattform für Stockwerkeigentümer und Immobilienverwaltungen - Android App und Website",
        "image":"./assets/mystweg.jpg"
    },
        {
        "id": "004",
        "customer": "HSLU",
        "title":"GoloLens",
        "tags":"SoDa, Pair Programming, Unity Game Engine, Visual Studio, C#.NET, Blender",
        "tagsArray":["SoDa","Pair Programming","Unity Game Engine","Visual Studio","C#.NET","Blender"],
        "description":"Das Ziel des Projekts ist es, einen Spiel-Prototypen für die Microsoft HoloLens zu entwickeln. Der Prototyp soll aufzeigen, was mit der Mixed Reality Brille möglich ist. Ich entwickelte als Teil eines Zweierteams ein Spiel in Unity Game Engine, welches die Microsoft HoloLens verwendet. Die dazugehörigen Scripts wurden mit C# entwickelt, die graphischen Elemente (Assets) mit Blender. Der Projektauftrag hat vorgesehen, ein Go Spiel zu entwickeln, welches von zwei Spielern mit je einer HoloLens im selben Raum gespielt werden kann. Als Projektvorgehensmodell wurde SoDa gewählt. Da das Projekt einen explorativen Charakter aufweist, haben wir eine lange Initialisierungsphase gewählt. Während dieser Phase konnten viele offenen Fragen geklärt und die geeignete Technologie ausgewählt werden. In den darauffolgenden Sprints wurde der Prototyp entwickelt. Das Informatikprojekt ist erfolgreich abgeschlossen und die HSLU verfügt über einen Prototypen, der für Vorführungen, sowie im Mixed Reality Lab der Hochschule verwendet werden kann. ",
        "shortDescription":"Spielentwicklung für Microsoft HoloLens"
    },
    {
        "id": "003",
        "customer": "HSLU",
        "title":"Webshop iCompany",
        "tags":"Java EE, JSF, JPA, JAX-WS, JAX-RS, JMS, Apache TomEE, Postman, SoapUI, IntelliJ, MySQL, Primefaces, Git",
        "tagsArray":["Java EE","JSF","JPA","JAX-WS","JAX-RS","JMS","Apache TomEE","Postman","SoapUI","IntelliJ","MySQL","Primefaces","Git"],
        "description":"iCompany ist eine virtuelle Unternehmung, welche als Handelsunternehmen im Musikbereich konzipiert ist. Sie dient an der HSLU Informatik als «Übungsanlage» für die Lehre in verschiedenen Modulen. Im Modul Enterprise Applications habe ich einen Webshop für den Verkauf von Mediendateien konzipiert und entwickelt. Durch den vorgegebenen Technologiestack konnte ich so Erfahrungen mit Java EE sammeln. Die Mediendateien werden über eine Schnittstelle zum ERP-System der iCompany (Microsoft Dynamics NAV) ausgelesen und im Webshop angezeigt. Die Bezahlung der gekauften Artikel werden über das Zahlungssystem der PostFinance ausgeführt. Nachdem die Verkäufe abgewickelt sind, werden sie per JMS ins ERP-System gespeichert. Das Modul konnte ich erfolgreich abschliessen und einen Überblick über die Entwicklung einer Enterprise Applikation gewinnen.",
        "shortDescription":""
    },
    {
        "id": "002",
        "customer": "Sage Schweiz AG",
        "title":"Sage 200 Absenzenmanagement",
        "tags":"Scrum, C#, MS SQL, ASP.NET, TFS, HTML, CSS, JavaScript",
        "tagsArray":["Scrum","C#","MS SQL", "ASP.NET", "TFS", "HTML", "CSS", "JavaScript"],
        "description":"Sage200 ist eine ERP-Software als Komplettlösung für mittelgrosse Unternehmen. Das Sage200 Personal Modul bietet Funktionen für die Erfassung von Absenzen für Mitarbeiter. Diese sollen einfacher zu benutzen und selbsterklärender gestaltet werden. Zusammen mit dem Scrum-Team habe ich die webbasierte Lösung «Absenzenmanagement» weiterentwickelt und gewartet. Dabei habe ich zusammen mit dem Product Owner die User Stories priorisiert und dann umgesetzt. Unterstützung erhielt ich beim Anpassen von konsumierten Services oder Fragen zu Best-Practices durch die Architektur-Abteilung. Das Tool «Absenzenmanagement» ermöglicht es den Sage200 Personal-Benutzern, einfacher Absenzen eintragen zu können, sowie die Übersicht über Absenzen innerhalb des Teams zu verbessern.",
        "shortDescription":"Sage200 Absenzenmanagement: Weblösung für Sage200 Benutzer"
    },
    {
        "id": "001",
        "customer": "Sage Schweiz AG",
        "title":"Weiterentwicklung und Wartung Sage200 Personal und CRM",
        "tags":"Scrum, C#, MS SQL, CrystalReports, .NET Core, TFS",
        "tagsArray":["Scrum","C#","MSSQL", "CrystalReports", ".NET Core", "TFS"],
        "description":"Die Bedienung der Sage200 - Module Personal und CRM war erschwert und die Ergebnisse inkonsistent. Zusammen mit dem Scrum Team konnte ich die bestehenden Schwachstellen priorisieren und verbessern. Bestehende Unit Tests konnte ich korrigieren und fehlende neu hinzufügen. Durch die Scrum Team-übergreifenden Review Meetings und Abnahmetests konnte ich sicherstellen, dass die Schwachstellen behoben sind. Sage Schweiz AG freut sich über eine stabile Software mit konsistentem Verhalten. Die verbesserte Usability ermöglicht es den Benutzern, die Software ohne zusätzliche Hilfe durch den Support zu bedienen.",
        "shortDescription":"Beschreibung Anstellung bei Sage Schweiz AG"
    }
]
